MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E1C32B0AGU1H000/mcu.h
/*******************************************************************************
* \brief Interrupt number definition for all type MCUs
*******************************************************************************/
#define FM_INTERRUPT_TYPE                         0x0130u

#define IRQ_NMI_AVAILABLE                         1
#define IRQ_HARDFAULT_AVAILABLE                   1
#define IRQ_SVC_AVAILABLE                         1
#define IRQ_PENDSV_AVAILABLE                      1
#define IRQ_SYSTICK_AVAILABLE                     1

#define IRQ_CSV_SWDT_LVD_AVAILABLE                1
#define IRQ_MFS0_RX_TX_AVAILABLE                  1
#define IRQ_MFS1_RX_TX_AVAILABLE                  1
#define IRQ_MFS3_RX_TX_AVAILABLE                  1
#define IRQ_MFS4_RX_TX_AVAILABLE                  1
#define IRQ_MFS6_RX_TX_I2CSLAVE_AVAILABLE         1
#define IRQ_MFS7_RX_TX_AVAILABLE                  1
#define IRQ_ADC0_AVAILABLE                        1
#define IRQ_USB0_F_ED123_AVAILABLE                1
#define IRQ_USB0_F_ED450I_AVAILABLE               1
#define IRQ_USB0_F_ED0O_ST_AVAILABLE              1
#define IRQ_USB0_H_AVAILABLE                      1
#define IRQ_TIM_AVAILABLE                         1
#define IRQ_WC_RTC_DT_AVAILABLE                   1
#define IRQ_EXINT0_1_AVAILABLE                    1
#define IRQ_EXINT2_3_AVAILABLE                    1
#define IRQ_EXINT4_5_AVAILABLE                    1
#define IRQ_EXINT6_7_AVAILABLE                    1
#define IRQ_EXINT8_AVAILABLE                      1
#define IRQ_EXINT12_13_AVAILABLE                  1
#define IRQ_EXINT15_AVAILABLE                     1
#define IRQ_BT0_4_AVAILABLE                       1
#define IRQ_BT1_5_AVAILABLE                       1
#define IRQ_BT2_6_AVAILABLE                       1
#define IRQ_BT3_7_AVAILABLE                       1
#define IRQ_HDMICEC0_1_AVAILABLE                  1
#define IRQ_SMCIF1_FLASHIF_AVAILABLE              1
#define IRQ_DSTC_AVAILABLE                        1


typedef enum IRQn
{
    NMI_IRQn                                      =  -14, /* Non Maskable Interrupt NMI */
    HardFault_IRQn                                =  -13, /* HardFault HardFault */
    SVC_IRQn                                      =   -5, /* SV Call SVC */
    PendSV_IRQn                                   =   -2, /* Pend SV PendSV */
    SysTick_IRQn                                  =   -1, /* System Tick SysTick */

    CSV_SWDT_LVD_IRQn                             =    0, /* CSV_SWDT_LVD_IRQ */
    MFS0_RX_TX_IRQn                               =    1, /* MFS0_RX_TX_IRQ */
    MFS1_RX_TX_IRQn                               =    2, /* MFS1_RX_TX_IRQ */
    MFS3_RX_TX_IRQn                               =    4, /* MFS3_RX_TX_IRQ */
    MFS4_RX_TX_IRQn                               =    5, /* MFS4_RX_TX_IRQ */
    MFS6_RX_TX_I2CSLAVE_IRQn                      =    7, /* MFS6_RX_TX_I2CSLAVE_IRQ */
    MFS7_RX_TX_IRQn                               =    8, /* MFS7_RX_TX_IRQ */
    ADC0_IRQn                                     =    9, /* ADC0_IRQ */
    USB0_F_ED123_IRQn                             =   10, /* USB0_F_ED123_IRQ */
    USB0_F_ED450I_IRQn                            =   11, /* USB0_F_ED450I_IRQ */
    USB0_F_ED0O_ST_IRQn                           =   12, /* USB0_F_ED0O_ST_IRQ */
    USB0_H_IRQn                                   =   13, /* USB0_H_IRQ */
    TIM_IRQn                                      =   14, /* TIM_IRQ */
    WC_RTC_DT_IRQn                                =   15, /* WC_RTC_DT_IRQ */
    EXINT0_1_IRQn                                 =   16, /* EXINT0_1_IRQ */
    EXINT2_3_IRQn                                 =   17, /* EXINT2_3_IRQ */
    EXINT4_5_IRQn                                 =   18, /* EXINT4_5_IRQ */
    EXINT6_7_IRQn                                 =   19, /* EXINT6_7_IRQ */
    EXINT8_IRQn                                   =   20, /* EXINT8_IRQ */
    EXINT12_13_IRQn                               =   22, /* EXINT12_13_IRQ */
    EXINT15_IRQn                                  =   23, /* EXINT15_IRQ */
    BT0_4_IRQn                                    =   24, /* BT0_4_IRQ */
    BT1_5_IRQn                                    =   25, /* BT1_5_IRQ */
    BT2_6_IRQn                                    =   26, /* BT2_6_IRQ */
    BT3_7_IRQn                                    =   27, /* BT3_7_IRQ */
    HDMICEC0_1_IRQn                               =   28, /* HDMICEC0_1_IRQ */
    SMCIF1_FLASHIF_IRQn                           =   29, /* SMCIF1_FLASHIF_IRQ */
    DSTC_IRQn                                     =   30, /* DSTC_IRQ */
} IRQn_Type;

#include "core_cm0plus.h"
#include <stdint.h>

/*******************************************************************************
* Device Specific Peripheral Registers structures
*******************************************************************************/
#if defined ( __CC_ARM   )
#pragma anon_unions
#endif

/*******************************************************************************
* ADC_MODULE
*******************************************************************************/
typedef struct stc_adc_adsr_field
{
        __IO   uint8_t  SCS                      :1;
        __IO   uint8_t  PCS                      :1;
        __IO   uint8_t  PCNS                     :1;
        __IO   uint8_t  RESERVED0                :3;
        __IO   uint8_t  FDAS                     :1;
        __IO   uint8_t  ADSTP                    :1;
} stc_adc_adsr_field_t;

typedef struct stc_adc_adcr_field
{
        __IO   uint8_t  OVRIE                    :1;
        __IO   uint8_t  CMPIE                    :1;
        __IO   uint8_t  PCIE                     :1;
        __IO   uint8_t  SCIE                     :1;
        __IO   uint8_t  RESERVED0                :1;
        __IO   uint8_t  CMPIF                    :1;
        __IO   uint8_t  PCIF                     :1;
        __IO   uint8_t  SCIF                     :1;
} stc_adc_adcr_field_t;

typedef struct stc_adc_sfns_field
{
    union {
        struct {
            __IO   uint8_t  SFS                  :4;
            __IO   uint8_t  RESERVED0            :4;
        };
        struct {
            __IO   uint8_t  SFS0                 :1;
            __IO   uint8_t  SFS1                 :1;
            __IO   uint8_t  SFS2                 :1;
            __IO   uint8_t  SFS3                 :1;
            __IO   uint8_t  RESERVED1            :4;
        };
    };
} stc_adc_sfns_field_t;

typedef struct stc_adc_sccr_field
{
        __IO   uint8_t  SSTR                     :1;
        __IO   uint8_t  SHEN                     :1;
        __IO   uint8_t  RPT                      :1;
        __IO   uint8_t  RESERVED0                :1;
        __IO   uint8_t  SFCLR                    :1;
        __IO   uint8_t  SOVR                     :1;
        __IO   uint8_t  SFUL                     :1;
        __IO   uint8_t  SEMP                     :1;
} stc_adc_sccr_field_t;

typedef struct stc_adc_scfd_fdas1_field
{
    union {
        struct {
            __IO  uint32_t  SC                   :5;
            __IO  uint32_t  RESERVED0            :3;
            __IO  uint32_t  RS                   :2;
            __IO  uint32_t  RESERVED2            :2;
            __IO  uint32_t  INVL                 :1;
            __IO  uint32_t  RESERVED3            :3;
            __IO  uint32_t  SD                   :12;
            __IO  uint32_t  RESERVED5            :4;
        };
        struct {
            __IO  uint32_t  SC0                  :1;
            __IO  uint32_t  SC1                  :1;
            __IO  uint32_t  SC2                  :1;
            __IO  uint32_t  SC3                  :1;
            __IO  uint32_t  SC4                  :1;
            __IO  uint32_t  RESERVED1            :3;
            __IO  uint32_t  RS0                  :1;
            __IO  uint32_t  RS1                  :1;
            __IO  uint32_t  RESERVED4            :6;
            __IO  uint32_t  SD0                  :1;
            __IO  uint32_t  SD1                  :1;
            __IO  uint32_t  SD2                  :1;
            __IO  uint32_t  SD3                  :1;
            __IO  uint32_t  SD4                  :1;
            __IO  uint32_t  SD5                  :1;
            __IO  uint32_t  SD6                  :1;
            __IO  uint32_t  SD7                  :1;
            __IO  uint32_t  SD8                  :1;
            __IO  uint32_t  SD9                  :1;
            __IO  uint32_t  SD10                 :1;
            __IO  uint32_t  SD11                 :1;
            __IO  uint32_t  RESERVED6            :4;
        };
    };
} stc_adc_scfd_fdas1_field_t;

typedef struct stc_adc_scfd_field
{
    union {
        struct {
            __IO  uint32_t  SC                   :5;
            __IO  uint32_t  RESERVED0            :3;
            __IO  uint32_t  RS                   :2;
            __IO  uint32_t  RESERVED2            :2;
            __IO  uint32_t  INVL                 :1;
            __IO  uint32_t  RESERVED3            :7;
            __IO  uint32_t  SD                   :12;
        };
        struct {
            __IO  uint32_t  SC0                  :1;
            __IO  uint32_t  SC1                  :1;
            __IO  uint32_t  SC2                  :1;
            __IO  uint32_t  SC3                  :1;
            __IO  uint32_t  SC4                  :1;
            __IO  uint32_t  RESERVED1            :3;
            __IO  uint32_t  RS0                  :1;
            __IO  uint32_t  RS1                  :1;
            __IO  uint32_t  RESERVED4            :10;
            __IO  uint32_t  SD0                  :1;
            __IO  uint32_t  SD1                  :1;
            __IO  uint32_t  SD2                  :1;
            __IO  uint32_t  SD3                  :1;
            __IO  uint32_t  SD4                  :1;
            __IO  uint32_t  SD5                  :1;
            __IO  uint32_t  SD6                  :1;
            __IO  uint32_t  SD7                  :1;
            __IO  uint32_t  SD8                  :1;
            __IO  uint32_t  SD9                  :1;
            __IO  uint32_t  SD10                 :1;
            __IO  uint32_t  SD11                 :1;
        };
    };
} stc_adc_scfd_field_t;

typedef struct stc_adc_scis23_field
{
        __IO  uint16_t  AN16                     :1;
        __IO  uint16_t  AN17                     :1;
        __IO  uint16_t  AN18                     :1;
        __IO  uint16_t  AN19                     :1;
        __IO  uint16_t  AN20                     :1;
        __IO  uint16_t  AN21                     :1;
        __IO  uint16_t  AN22                     :1;
        __IO  uint16_t  AN23                     :1;
        __IO  uint16_t  AN24                     :1;
        __IO  uint16_t  AN25                     :1;
        __IO  uint16_t  AN26                     :1;
        __IO  uint16_t  AN27                     :1;
        __IO  uint16_t  AN28                     :1;
        __IO  uint16_t  AN29                     :1;
        __IO  uint16_t  AN30                     :1;
        __IO  uint16_t  AN31                     :1;
} stc_adc_scis23_field_t;

typedef struct stc_adc_scis01_field
{
        __IO  uint16_t  AN0                      :1;
        __IO  uint16_t  AN1                      :1;
        __IO  uint16_t  AN2                      :1;
        __IO  uint16_t  AN3                      :1;
        __IO  uint16_t  AN4                      :1;
        __IO  uint16_t  AN5                      :1;
        __IO  uint16_t  AN6                      :1;
        __IO  uint16_t  AN7                      :1;
        __IO  uint16_t  AN8                      :1;
        __IO  uint16_t  AN9                      :1;
        __IO  uint16_t  AN10                     :1;
        __IO  uint16_t  AN11                     :1;
        __IO  uint16_t  AN12                     :1;
        __IO  uint16_t  AN13                     :1;
        __IO  uint16_t  AN14                     :1;
        __IO  uint16_t  AN15                     :1;
} stc_adc_scis01_field_t;

typedef struct stc_adc_pfns_field
{
    union {
        struct {
            __IO   uint8_t  PFS                  :2;
            __IO   uint8_t  RESERVED0            :2;
            __IO   uint8_t  TEST                 :2;
            __IO   uint8_t  RESERVED2            :2;
        };
        struct {
            __IO   uint8_t  PFS0                 :1;
            __IO   uint8_t  PFS1                 :1;
            __IO   uint8_t  RESERVED1            :2;
            __IO   uint8_t  TEST0                :1;
            __IO   uint8_t  TEST1                :1;
            __IO   uint8_t  RESERVED3            :2;
        };
    };
} stc_adc_pfns_field_t;

typedef struct stc_adc_pccr_field
{
        __IO   uint8_t  PSTR                     :1;
        __IO   uint8_t  PHEN                     :1;
        __IO   uint8_t  PEEN                     :1;
        __IO   uint8_t  ESCE                     :1;
        __IO   uint8_t  PFCLR                    :1;
        __IO   uint8_t  POVR                     :1;
        __IO   uint8_t  PFUL                     :1;
        __IO   uint8_t  PEMP                     :1;
} stc_adc_pccr_field_t;

