MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E1C32B0AGU1H000/mcu.h
/*******************************************************************************
* USBCLK_MODULE
*   register structur
*******************************************************************************/
typedef struct
{
    union {
        __IO  uint8_t UCCR;
        stc_usbclk_uccr_field_t UCCR_f;
    };
        __IO  uint8_t RESERVED0[39];
    union {
        __IO  uint8_t UPCR6;
        stc_usbclk_upcr6_field_t UPCR6_f;
    };
        __IO  uint8_t RESERVED1[7];
    union {
        __IO  uint8_t USBEN0;
        stc_usbclk_usben0_field_t USBEN0_f;
    };
} FM_USBCLK_TypeDef, FM0P_USBCLK_TypeDef;

/*******************************************************************************
* VIR_MODULE
*   register structur
*******************************************************************************/
typedef struct
{
    union {
        __IO uint32_t VIR00;
        struct {
          union {
            __IO uint16_t VIR00L;
            struct {
              __IO uint8_t VIR00LL;
              __IO uint8_t VIR00LH;
            };
          };
          union {
            __IO uint16_t VIR00H;
            struct {
              __IO uint8_t VIR00HL;
              __IO uint8_t VIR00HH;
            };
          };
        };
    };
    union {
        __IO uint32_t VIR01;
        struct {
          union {
            __IO uint16_t VIR01L;
            struct {
              __IO uint8_t VIR01LL;
              __IO uint8_t VIR01LH;
            };
          };
          union {
            __IO uint16_t VIR01H;
            struct {
              __IO uint8_t VIR01HL;
              __IO uint8_t VIR01HH;
            };
          };
        };
    };
    union {
        __IO uint32_t VIR02;
        struct {
          union {
            __IO uint16_t VIR02L;
            struct {
              __IO uint8_t VIR02LL;
              __IO uint8_t VIR02LH;
            };
          };
          union {
            __IO uint16_t VIR02H;
            struct {
              __IO uint8_t VIR02HL;
              __IO uint8_t VIR02HH;
            };
          };
        };
    };
    union {
        __IO uint32_t VIR03;
        struct {
          union {
            __IO uint16_t VIR03L;
            struct {
              __IO uint8_t VIR03LL;
              __IO uint8_t VIR03LH;
            };
          };
          union {
            __IO uint16_t VIR03H;
            struct {
              __IO uint8_t VIR03HL;
              __IO uint8_t VIR03HH;
            };
          };
        };
    };
    union {
        __IO uint32_t VIR04;
        struct {
          union {
            __IO uint16_t VIR04L;
            struct {
              __IO uint8_t VIR04LL;
              __IO uint8_t VIR04LH;
            };
          };
          union {
            __IO uint16_t VIR04H;
            struct {
              __IO uint8_t VIR04HL;
              __IO uint8_t VIR04HH;
            };
          };
        };
    };
    union {
        __IO uint32_t VIR05;
        struct {
          union {
            __IO uint16_t VIR05L;
            struct {
              __IO uint8_t VIR05LL;
              __IO uint8_t VIR05LH;
            };
          };
          union {
            __IO uint16_t VIR05H;
            struct {
              __IO uint8_t VIR05HL;
              __IO uint8_t VIR05HH;
            };
          };
        };
    };
    union {
        __IO uint32_t VIR06;
        struct {
          union {
            __IO uint16_t VIR06L;
            struct {
              __IO uint8_t VIR06LL;
              __IO uint8_t VIR06LH;
            };
          };
          union {
            __IO uint16_t VIR06H;
            struct {
              __IO uint8_t VIR06HL;
              __IO uint8_t VIR06HH;
            };
          };
        };
    };
    union {
        __IO uint32_t VIR07;
        struct {
          union {
            __IO uint16_t VIR07L;
            struct {
              __IO uint8_t VIR07LL;
              __IO uint8_t VIR07LH;
            };
          };
          union {
            __IO uint16_t VIR07H;
            struct {
              __IO uint8_t VIR07HL;
              __IO uint8_t VIR07HH;
            };
          };
        };
    };
    union {
        __IO uint32_t VIR08;
        struct {
          union {
            __IO uint16_t VIR08L;
            struct {
              __IO uint8_t VIR08LL;
              __IO uint8_t VIR08LH;
            };
          };
          union {
            __IO uint16_t VIR08H;
            struct {
              __IO uint8_t VIR08HL;
              __IO uint8_t VIR08HH;
            };
          };
        };
    };
    union {
        __IO uint32_t VIR09;
        struct {
          union {
            __IO uint16_t VIR09L;
            struct {
              __IO uint8_t VIR09LL;
              __IO uint8_t VIR09LH;
            };
          };
          union {
            __IO uint16_t VIR09H;
            struct {
              __IO uint8_t VIR09HL;
              __IO uint8_t VIR09HH;
            };
          };
        };
    };
    union {
        __IO uint32_t VIR10;
        struct {
          union {
            __IO uint16_t VIR10L;
            struct {
              __IO uint8_t VIR10LL;
              __IO uint8_t VIR10LH;
            };
          };
          union {
            __IO uint16_t VIR10H;
            struct {
              __IO uint8_t VIR10HL;
              __IO uint8_t VIR10HH;
            };
          };
        };
    };
    union {
        __IO uint32_t VIR11;
        struct {
          union {
            __IO uint16_t VIR11L;
            struct {
              __IO uint8_t VIR11LL;
              __IO uint8_t VIR11LH;
            };
          };
          union {
            __IO uint16_t VIR11H;
            struct {
              __IO uint8_t VIR11HL;
              __IO uint8_t VIR11HH;
            };
          };
        };
    };
    union {
        __IO uint32_t VIR12;
        struct {
          union {
            __IO uint16_t VIR12L;
            struct {
              __IO uint8_t VIR12LL;
              __IO uint8_t VIR12LH;
            };
          };
          union {
            __IO uint16_t VIR12H;
            struct {
              __IO uint8_t VIR12HL;
              __IO uint8_t VIR12HH;
            };
          };
        };
    };
    union {
        __IO uint32_t VIR13;
        struct {
          union {
            __IO uint16_t VIR13L;
            struct {
              __IO uint8_t VIR13LL;
              __IO uint8_t VIR13LH;
            };
          };
          union {
            __IO uint16_t VIR13H;
            struct {
              __IO uint8_t VIR13HL;
              __IO uint8_t VIR13HH;
            };
          };
        };
    };
    union {
        __IO uint32_t VIR14;
        struct {
          union {
            __IO uint16_t VIR14L;
            struct {
              __IO uint8_t VIR14LL;
              __IO uint8_t VIR14LH;
            };
          };
          union {
            __IO uint16_t VIR14H;
            struct {
              __IO uint8_t VIR14HL;
              __IO uint8_t VIR14HH;
            };
          };
        };
    };
    union {
        __IO uint32_t VIR15;
        struct {
          union {
            __IO uint16_t VIR15L;
            struct {
              __IO uint8_t VIR15LL;
              __IO uint8_t VIR15LH;
            };
          };
          union {
            __IO uint16_t VIR15H;
            struct {
              __IO uint8_t VIR15HL;
              __IO uint8_t VIR15HH;
            };
          };
        };
    };
    union {
        __IO uint32_t VIR16;
        struct {
          union {
            __IO uint16_t VIR16L;
            struct {
              __IO uint8_t VIR16LL;
              __IO uint8_t VIR16LH;
            };
          };
          union {
            __IO uint16_t VIR16H;
            struct {
              __IO uint8_t VIR16HL;
              __IO uint8_t VIR16HH;
            };
          };
        };
    };
    union {
        __IO uint32_t VIR17;
        struct {
          union {
            __IO uint16_t VIR17L;
            struct {
              __IO uint8_t VIR17LL;
              __IO uint8_t VIR17LH;
            };
          };
          union {
            __IO uint16_t VIR17H;
            struct {
              __IO uint8_t VIR17HL;
              __IO uint8_t VIR17HH;
            };
          };
        };
    };
    union {
        __IO uint32_t VIR18;
        struct {
          union {
            __IO uint16_t VIR18L;
            struct {
              __IO uint8_t VIR18LL;
              __IO uint8_t VIR18LH;
            };
          };
          union {
            __IO uint16_t VIR18H;
            struct {
              __IO uint8_t VIR18HL;
              __IO uint8_t VIR18HH;
            };
          };
        };
    };
    union {
        __IO uint32_t VIR19;
        struct {
          union {
            __IO uint16_t VIR19L;
            struct {
              __IO uint8_t VIR19LL;
              __IO uint8_t VIR19LH;
            };
          };
          union {
            __IO uint16_t VIR19H;
            struct {
              __IO uint8_t VIR19HL;
              __IO uint8_t VIR19HH;
            };
          };
        };
    };
    union {
        __IO uint32_t VIR20;
        struct {
          union {
            __IO uint16_t VIR20L;
            struct {
              __IO uint8_t VIR20LL;
              __IO uint8_t VIR20LH;
            };
          };
          union {
            __IO uint16_t VIR20H;
            struct {
              __IO uint8_t VIR20HL;
              __IO uint8_t VIR20HH;
            };
          };
        };
    };
    union {
        __IO uint32_t VIR21;
        struct {
          union {
            __IO uint16_t VIR21L;
            struct {
              __IO uint8_t VIR21LL;
              __IO uint8_t VIR21LH;
            };
          };
          union {
            __IO uint16_t VIR21H;
            struct {
              __IO uint8_t VIR21HL;
              __IO uint8_t VIR21HH;
            };
          };
        };
    };
    union {
        __IO uint32_t VIR22;
        struct {
          union {
            __IO uint16_t VIR22L;
            struct {
              __IO uint8_t VIR22LL;
              __IO uint8_t VIR22LH;
            };
          };
          union {
            __IO uint16_t VIR22H;
            struct {
              __IO uint8_t VIR22HL;
              __IO uint8_t VIR22HH;
            };
          };
        };
    };
    union {
        __IO uint32_t VIR23;
        struct {
          union {
            __IO uint16_t VIR23L;
            struct {
              __IO uint8_t VIR23LL;
              __IO uint8_t VIR23LH;
            };
          };
          union {
            __IO uint16_t VIR23H;
            struct {
              __IO uint8_t VIR23HL;
              __IO uint8_t VIR23HH;
            };
          };
        };
    };
    union {
        __IO uint32_t VIR24;
        struct {
          union {
            __IO uint16_t VIR24L;
            struct {
              __IO uint8_t VIR24LL;
              __IO uint8_t VIR24LH;
            };
          };
          union {
            __IO uint16_t VIR24H;
            struct {
              __IO uint8_t VIR24HL;
              __IO uint8_t VIR24HH;
            };
          };
        };
    };
    union {
        __IO uint32_t VIR25;
        struct {
          union {
            __IO uint16_t VIR25L;
            struct {
              __IO uint8_t VIR25LL;
              __IO uint8_t VIR25LH;
            };
          };
          union {
            __IO uint16_t VIR25H;
            struct {
              __IO uint8_t VIR25HL;
              __IO uint8_t VIR25HH;
            };
          };
        };
    };
    union {
        __IO uint32_t VIR26;
        struct {
          union {
            __IO uint16_t VIR26L;
            struct {
              __IO uint8_t VIR26LL;
              __IO uint8_t VIR26LH;
            };
          };
          union {
            __IO uint16_t VIR26H;
            struct {
              __IO uint8_t VIR26HL;
              __IO uint8_t VIR26HH;
            };
          };
        };
    };
    union {
        __IO uint32_t VIR27;
        struct {
          union {
            __IO uint16_t VIR27L;
            struct {
              __IO uint8_t VIR27LL;
              __IO uint8_t VIR27LH;
            };
          };
          union {
            __IO uint16_t VIR27H;
            struct {
              __IO uint8_t VIR27HL;
              __IO uint8_t VIR27HH;
            };
          };
        };
    };
    union {
        __IO uint32_t VIR28;
        struct {
          union {
            __IO uint16_t VIR28L;
            struct {
              __IO uint8_t VIR28LL;
              __IO uint8_t VIR28LH;
            };
          };
          union {
            __IO uint16_t VIR28H;
            struct {
              __IO uint8_t VIR28HL;
              __IO uint8_t VIR28HH;
            };
          };
        };
    };
    union {
        __IO uint32_t VIR29;
        struct {
          union {
            __IO uint16_t VIR29L;
            struct {
              __IO uint8_t VIR29LL;
              __IO uint8_t VIR29LH;
            };
          };
          union {
            __IO uint16_t VIR29H;
            struct {
              __IO uint8_t VIR29HL;
              __IO uint8_t VIR29HH;
            };
          };
        };
    };
    union {
        __IO uint32_t VIR30;
        struct {
          union {
            __IO uint16_t VIR30L;
            struct {
              __IO uint8_t VIR30LL;
              __IO uint8_t VIR30LH;
            };
          };
          union {
            __IO uint16_t VIR30H;
            struct {
              __IO uint8_t VIR30HL;
              __IO uint8_t VIR30HH;
            };
          };
        };
    };
    union {
        __IO uint32_t VIR31;
        struct {
          union {
            __IO uint16_t VIR31L;
            struct {
              __IO uint8_t VIR31LL;
              __IO uint8_t VIR31LH;
            };
          };
          union {
            __IO uint16_t VIR31H;
            struct {
              __IO uint8_t VIR31HL;
              __IO uint8_t VIR31HH;
            };
          };
        };
    };
} FM_VIR_TypeDef, FM0P_VIR_TypeDef;

