MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E1C32B0AGU1H000/mcu.h
#define bFM_EXTI_NMICL_NCL                        *((volatile  uint8_t *)(0x42600300UL))
#define bFM0P_EXTI_NMICL_NCL                      *((volatile  uint8_t *)(0x42600300UL))

#define bFM_EXTI_NMIENR_NE0                       *((volatile  uint8_t *)(0x42600400UL))
#define bFM0P_EXTI_NMIENR_NE0                     *((volatile  uint8_t *)(0x42600400UL))

#define bFM_EXTI_NMIRR_NR                         *((volatile  uint8_t *)(0x42600280UL))
#define bFM0P_EXTI_NMIRR_NR                       *((volatile  uint8_t *)(0x42600280UL))


/*******************************************************************************
* FASTIO Registers FASTIO
*   Bitband Section
*******************************************************************************/
#define bFM_FASTIO_FPDIR0_P1                      *((volatile  uint8_t *)(0xF8010008UL))
#define bFM0P_FASTIO_FPDIR0_P1                    *((volatile  uint8_t *)(0xF8010008UL))
#define bFM_FASTIO_FPDIR0_P3                      *((volatile  uint8_t *)(0xF8010020UL))
#define bFM0P_FASTIO_FPDIR0_P3                    *((volatile  uint8_t *)(0xF8010020UL))
#define bFM_FASTIO_FPDIR0_P5                      *((volatile  uint8_t *)(0xF8010080UL))
#define bFM0P_FASTIO_FPDIR0_P5                    *((volatile  uint8_t *)(0xF8010080UL))
#define bFM_FASTIO_FPDIR0_PF                      *((volatile  uint8_t *)(0xF8010201UL))
#define bFM0P_FASTIO_FPDIR0_PF                    *((volatile  uint8_t *)(0xF8010201UL))

#define bFM_FASTIO_FPDIR1_P0                      *((volatile  uint8_t *)(0xF8010404UL))
#define bFM0P_FASTIO_FPDIR1_P0                    *((volatile  uint8_t *)(0xF8010404UL))
#define bFM_FASTIO_FPDIR1_P1                      *((volatile  uint8_t *)(0xF8010408UL))
#define bFM0P_FASTIO_FPDIR1_P1                    *((volatile  uint8_t *)(0xF8010408UL))
#define bFM_FASTIO_FPDIR1_P2                      *((volatile  uint8_t *)(0xF8010410UL))
#define bFM0P_FASTIO_FPDIR1_P2                    *((volatile  uint8_t *)(0xF8010410UL))
#define bFM_FASTIO_FPDIR1_P3                      *((volatile  uint8_t *)(0xF8010420UL))
#define bFM0P_FASTIO_FPDIR1_P3                    *((volatile  uint8_t *)(0xF8010420UL))

#define bFM_FASTIO_FPDIR2_P1                      *((volatile  uint8_t *)(0xF8010808UL))
#define bFM0P_FASTIO_FPDIR2_P1                    *((volatile  uint8_t *)(0xF8010808UL))
#define bFM_FASTIO_FPDIR2_P2                      *((volatile  uint8_t *)(0xF8010810UL))
#define bFM0P_FASTIO_FPDIR2_P2                    *((volatile  uint8_t *)(0xF8010810UL))
#define bFM_FASTIO_FPDIR2_P3                      *((volatile  uint8_t *)(0xF8010820UL))
#define bFM0P_FASTIO_FPDIR2_P3                    *((volatile  uint8_t *)(0xF8010820UL))

#define bFM_FASTIO_FPDIR3_P1                      *((volatile  uint8_t *)(0xF8010C08UL))
#define bFM0P_FASTIO_FPDIR3_P1                    *((volatile  uint8_t *)(0xF8010C08UL))
#define bFM_FASTIO_FPDIR3_P2                      *((volatile  uint8_t *)(0xF8010C10UL))
#define bFM0P_FASTIO_FPDIR3_P2                    *((volatile  uint8_t *)(0xF8010C10UL))
#define bFM_FASTIO_FPDIR3_P3                      *((volatile  uint8_t *)(0xF8010C20UL))
#define bFM0P_FASTIO_FPDIR3_P3                    *((volatile  uint8_t *)(0xF8010C20UL))

#define bFM_FASTIO_FPDIR4_P6                      *((volatile  uint8_t *)(0xF8011100UL))
#define bFM0P_FASTIO_FPDIR4_P6                    *((volatile  uint8_t *)(0xF8011100UL))
#define bFM_FASTIO_FPDIR4_P7                      *((volatile  uint8_t *)(0xF8011200UL))
#define bFM0P_FASTIO_FPDIR4_P7                    *((volatile  uint8_t *)(0xF8011200UL))

#define bFM_FASTIO_FPDIR5_P0                      *((volatile  uint8_t *)(0xF8011404UL))
#define bFM0P_FASTIO_FPDIR5_P0                    *((volatile  uint8_t *)(0xF8011404UL))
#define bFM_FASTIO_FPDIR5_P1                      *((volatile  uint8_t *)(0xF8011408UL))
#define bFM0P_FASTIO_FPDIR5_P1                    *((volatile  uint8_t *)(0xF8011408UL))
#define bFM_FASTIO_FPDIR5_P2                      *((volatile  uint8_t *)(0xF8011410UL))
#define bFM0P_FASTIO_FPDIR5_P2                    *((volatile  uint8_t *)(0xF8011410UL))

#define bFM_FASTIO_FPDIR6_P0                      *((volatile  uint8_t *)(0xF8011804UL))
#define bFM0P_FASTIO_FPDIR6_P0                    *((volatile  uint8_t *)(0xF8011804UL))

#define bFM_FASTIO_FPDIR8_P0                      *((volatile  uint8_t *)(0xF8012004UL))
#define bFM0P_FASTIO_FPDIR8_P0                    *((volatile  uint8_t *)(0xF8012004UL))
#define bFM_FASTIO_FPDIR8_P1                      *((volatile  uint8_t *)(0xF8012008UL))
#define bFM0P_FASTIO_FPDIR8_P1                    *((volatile  uint8_t *)(0xF8012008UL))

#define bFM_FASTIO_FPDIRE_P2                      *((volatile  uint8_t *)(0xF8013810UL))
#define bFM0P_FASTIO_FPDIRE_P2                    *((volatile  uint8_t *)(0xF8013810UL))
#define bFM_FASTIO_FPDIRE_P3                      *((volatile  uint8_t *)(0xF8013820UL))
#define bFM0P_FASTIO_FPDIRE_P3                    *((volatile  uint8_t *)(0xF8013820UL))

#define bFM_FASTIO_FPDOR0_P1                      *((volatile  uint8_t *)(0xF8014008UL))
#define bFM0P_FASTIO_FPDOR0_P1                    *((volatile  uint8_t *)(0xF8014008UL))
#define bFM_FASTIO_FPDOR0_P3                      *((volatile  uint8_t *)(0xF8014020UL))
#define bFM0P_FASTIO_FPDOR0_P3                    *((volatile  uint8_t *)(0xF8014020UL))
#define bFM_FASTIO_FPDOR0_P5                      *((volatile  uint8_t *)(0xF8014080UL))
#define bFM0P_FASTIO_FPDOR0_P5                    *((volatile  uint8_t *)(0xF8014080UL))
#define bFM_FASTIO_FPDOR0_PF                      *((volatile  uint8_t *)(0xF8014201UL))
#define bFM0P_FASTIO_FPDOR0_PF                    *((volatile  uint8_t *)(0xF8014201UL))

#define bFM_FASTIO_FPDOR1_P0                      *((volatile  uint8_t *)(0xF8014404UL))
#define bFM0P_FASTIO_FPDOR1_P0                    *((volatile  uint8_t *)(0xF8014404UL))
#define bFM_FASTIO_FPDOR1_P1                      *((volatile  uint8_t *)(0xF8014408UL))
#define bFM0P_FASTIO_FPDOR1_P1                    *((volatile  uint8_t *)(0xF8014408UL))
#define bFM_FASTIO_FPDOR1_P2                      *((volatile  uint8_t *)(0xF8014410UL))
#define bFM0P_FASTIO_FPDOR1_P2                    *((volatile  uint8_t *)(0xF8014410UL))
#define bFM_FASTIO_FPDOR1_P3                      *((volatile  uint8_t *)(0xF8014420UL))
#define bFM0P_FASTIO_FPDOR1_P3                    *((volatile  uint8_t *)(0xF8014420UL))

#define bFM_FASTIO_FPDOR2_P1                      *((volatile  uint8_t *)(0xF8014808UL))
#define bFM0P_FASTIO_FPDOR2_P1                    *((volatile  uint8_t *)(0xF8014808UL))
#define bFM_FASTIO_FPDOR2_P2                      *((volatile  uint8_t *)(0xF8014810UL))
#define bFM0P_FASTIO_FPDOR2_P2                    *((volatile  uint8_t *)(0xF8014810UL))
#define bFM_FASTIO_FPDOR2_P3                      *((volatile  uint8_t *)(0xF8014820UL))
#define bFM0P_FASTIO_FPDOR2_P3                    *((volatile  uint8_t *)(0xF8014820UL))

#define bFM_FASTIO_FPDOR3_P1                      *((volatile  uint8_t *)(0xF8014C08UL))
#define bFM0P_FASTIO_FPDOR3_P1                    *((volatile  uint8_t *)(0xF8014C08UL))
#define bFM_FASTIO_FPDOR3_P2                      *((volatile  uint8_t *)(0xF8014C10UL))
#define bFM0P_FASTIO_FPDOR3_P2                    *((volatile  uint8_t *)(0xF8014C10UL))
#define bFM_FASTIO_FPDOR3_P3                      *((volatile  uint8_t *)(0xF8014C20UL))
#define bFM0P_FASTIO_FPDOR3_P3                    *((volatile  uint8_t *)(0xF8014C20UL))

#define bFM_FASTIO_FPDOR4_P6                      *((volatile  uint8_t *)(0xF8015100UL))
#define bFM0P_FASTIO_FPDOR4_P6                    *((volatile  uint8_t *)(0xF8015100UL))
#define bFM_FASTIO_FPDOR4_P7                      *((volatile  uint8_t *)(0xF8015200UL))
#define bFM0P_FASTIO_FPDOR4_P7                    *((volatile  uint8_t *)(0xF8015200UL))

