MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E1C32B0AGU1H000/mcu.h
#define bFM_I2CSLAVE_IBSSSR_TDRES                 *((volatile  uint8_t *)(0x426F32A0UL))
#define bFM0P_I2CSLAVE_IBSSSR_TDRES               *((volatile  uint8_t *)(0x426F32A0UL))


/*******************************************************************************
* INTREQ Registers INTREQ
*   Bitband Section
*******************************************************************************/
#define bFM_INTREQ_EXC02MON_NMI                   *((volatile  uint8_t *)(0x42624000UL))
#define bFM0P_INTREQ_EXC02MON_NMI                 *((volatile  uint8_t *)(0x42624000UL))
#define bFM_INTREQ_EXC02MON_HWINT                 *((volatile  uint8_t *)(0x42624004UL))
#define bFM0P_INTREQ_EXC02MON_HWINT               *((volatile  uint8_t *)(0x42624004UL))

#define bFM_INTREQ_IRQ00MON_INT0                  *((volatile  uint8_t *)(0x42624080UL))
#define bFM0P_INTREQ_IRQ00MON_INT0                *((volatile  uint8_t *)(0x42624080UL))
#define bFM_INTREQ_IRQ00MON_INT1                  *((volatile  uint8_t *)(0x42624084UL))
#define bFM0P_INTREQ_IRQ00MON_INT1                *((volatile  uint8_t *)(0x42624084UL))
#define bFM_INTREQ_IRQ00MON_INT2                  *((volatile  uint8_t *)(0x42624088UL))
#define bFM0P_INTREQ_IRQ00MON_INT2                *((volatile  uint8_t *)(0x42624088UL))

#define bFM_INTREQ_IRQ01MON_INT0                  *((volatile  uint8_t *)(0x42624100UL))
#define bFM0P_INTREQ_IRQ01MON_INT0                *((volatile  uint8_t *)(0x42624100UL))
#define bFM_INTREQ_IRQ01MON_INT1                  *((volatile  uint8_t *)(0x42624104UL))
#define bFM0P_INTREQ_IRQ01MON_INT1                *((volatile  uint8_t *)(0x42624104UL))
#define bFM_INTREQ_IRQ01MON_INT2                  *((volatile  uint8_t *)(0x42624108UL))
#define bFM0P_INTREQ_IRQ01MON_INT2                *((volatile  uint8_t *)(0x42624108UL))

#define bFM_INTREQ_IRQ02MON_INT0                  *((volatile  uint8_t *)(0x42624180UL))
#define bFM0P_INTREQ_IRQ02MON_INT0                *((volatile  uint8_t *)(0x42624180UL))
#define bFM_INTREQ_IRQ02MON_INT1                  *((volatile  uint8_t *)(0x42624184UL))
#define bFM0P_INTREQ_IRQ02MON_INT1                *((volatile  uint8_t *)(0x42624184UL))
#define bFM_INTREQ_IRQ02MON_INT2                  *((volatile  uint8_t *)(0x42624188UL))
#define bFM0P_INTREQ_IRQ02MON_INT2                *((volatile  uint8_t *)(0x42624188UL))

#define bFM_INTREQ_IRQ03MON_INT0                  *((volatile  uint8_t *)(0x42624200UL))
#define bFM0P_INTREQ_IRQ03MON_INT0                *((volatile  uint8_t *)(0x42624200UL))
#define bFM_INTREQ_IRQ03MON_INT1                  *((volatile  uint8_t *)(0x42624204UL))
#define bFM0P_INTREQ_IRQ03MON_INT1                *((volatile  uint8_t *)(0x42624204UL))
#define bFM_INTREQ_IRQ03MON_INT2                  *((volatile  uint8_t *)(0x42624208UL))
#define bFM0P_INTREQ_IRQ03MON_INT2                *((volatile  uint8_t *)(0x42624208UL))

#define bFM_INTREQ_IRQ04MON_INT0                  *((volatile  uint8_t *)(0x42624280UL))
#define bFM0P_INTREQ_IRQ04MON_INT0                *((volatile  uint8_t *)(0x42624280UL))
#define bFM_INTREQ_IRQ04MON_INT1                  *((volatile  uint8_t *)(0x42624284UL))
#define bFM0P_INTREQ_IRQ04MON_INT1                *((volatile  uint8_t *)(0x42624284UL))
#define bFM_INTREQ_IRQ04MON_INT2                  *((volatile  uint8_t *)(0x42624288UL))
#define bFM0P_INTREQ_IRQ04MON_INT2                *((volatile  uint8_t *)(0x42624288UL))

#define bFM_INTREQ_IRQ05MON_INT0                  *((volatile  uint8_t *)(0x42624300UL))
#define bFM0P_INTREQ_IRQ05MON_INT0                *((volatile  uint8_t *)(0x42624300UL))
#define bFM_INTREQ_IRQ05MON_INT1                  *((volatile  uint8_t *)(0x42624304UL))
#define bFM0P_INTREQ_IRQ05MON_INT1                *((volatile  uint8_t *)(0x42624304UL))
#define bFM_INTREQ_IRQ05MON_INT2                  *((volatile  uint8_t *)(0x42624308UL))
#define bFM0P_INTREQ_IRQ05MON_INT2                *((volatile  uint8_t *)(0x42624308UL))

#define bFM_INTREQ_IRQ06MON_INT0                  *((volatile  uint8_t *)(0x42624380UL))
#define bFM0P_INTREQ_IRQ06MON_INT0                *((volatile  uint8_t *)(0x42624380UL))
#define bFM_INTREQ_IRQ06MON_INT1                  *((volatile  uint8_t *)(0x42624384UL))
#define bFM0P_INTREQ_IRQ06MON_INT1                *((volatile  uint8_t *)(0x42624384UL))
#define bFM_INTREQ_IRQ06MON_INT2                  *((volatile  uint8_t *)(0x42624388UL))
#define bFM0P_INTREQ_IRQ06MON_INT2                *((volatile  uint8_t *)(0x42624388UL))

#define bFM_INTREQ_IRQ07MON_INT0                  *((volatile  uint8_t *)(0x42624400UL))
#define bFM0P_INTREQ_IRQ07MON_INT0                *((volatile  uint8_t *)(0x42624400UL))
#define bFM_INTREQ_IRQ07MON_INT1                  *((volatile  uint8_t *)(0x42624404UL))
#define bFM0P_INTREQ_IRQ07MON_INT1                *((volatile  uint8_t *)(0x42624404UL))
#define bFM_INTREQ_IRQ07MON_INT2                  *((volatile  uint8_t *)(0x42624408UL))
#define bFM0P_INTREQ_IRQ07MON_INT2                *((volatile  uint8_t *)(0x42624408UL))

#define bFM_INTREQ_IRQ08MON_INT0                  *((volatile  uint8_t *)(0x42624480UL))
#define bFM0P_INTREQ_IRQ08MON_INT0                *((volatile  uint8_t *)(0x42624480UL))
#define bFM_INTREQ_IRQ08MON_INT1                  *((volatile  uint8_t *)(0x42624484UL))
#define bFM0P_INTREQ_IRQ08MON_INT1                *((volatile  uint8_t *)(0x42624484UL))
#define bFM_INTREQ_IRQ08MON_INT2                  *((volatile  uint8_t *)(0x42624488UL))
#define bFM0P_INTREQ_IRQ08MON_INT2                *((volatile  uint8_t *)(0x42624488UL))

#define bFM_INTREQ_IRQ09MON_INT0                  *((volatile  uint8_t *)(0x42624500UL))
#define bFM0P_INTREQ_IRQ09MON_INT0                *((volatile  uint8_t *)(0x42624500UL))
#define bFM_INTREQ_IRQ09MON_INT1                  *((volatile  uint8_t *)(0x42624504UL))
#define bFM0P_INTREQ_IRQ09MON_INT1                *((volatile  uint8_t *)(0x42624504UL))
#define bFM_INTREQ_IRQ09MON_INT2                  *((volatile  uint8_t *)(0x42624508UL))
#define bFM0P_INTREQ_IRQ09MON_INT2                *((volatile  uint8_t *)(0x42624508UL))

#define bFM_INTREQ_IRQ10MON_INT0                  *((volatile  uint8_t *)(0x42624580UL))
#define bFM0P_INTREQ_IRQ10MON_INT0                *((volatile  uint8_t *)(0x42624580UL))
#define bFM_INTREQ_IRQ10MON_INT1                  *((volatile  uint8_t *)(0x42624584UL))
#define bFM0P_INTREQ_IRQ10MON_INT1                *((volatile  uint8_t *)(0x42624584UL))
#define bFM_INTREQ_IRQ10MON_INT2                  *((volatile  uint8_t *)(0x42624588UL))
#define bFM0P_INTREQ_IRQ10MON_INT2                *((volatile  uint8_t *)(0x42624588UL))

